Plan:

```
Terraform will perform the following actions:
  # aws_route53_record.cloudfront_index_domain will be created
  + resource "aws_route53_record" "cloudfront_index_domain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "cloudfront-index.crates.io"
      + records         = [
          + "d16zogpfyuwazr.cloudfront.net",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z3HLPL7SRE1VK5"
    }
  # aws_route53_record.fastly_index_domain will be created
  + resource "aws_route53_record" "fastly_index_domain" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "fastly-index.crates.io"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z3HLPL7SRE1VK5"
    }
  # fastly_service_compute.static will be updated in-place
  ~ resource "fastly_service_compute" "static" {
      ~ active_version = 47 -> (known after apply)
      ~ cloned_version = 47 -> (known after apply)
        id             = "gEfRWQihVaQqh6vsPlY0H1"
        name           = "static.crates.io"
        # (4 unchanged attributes hidden)
      ~ package {
          ~ source_code_hash = "7669bf387613799e12c01d21612db9372a16a7c7d53b57710e2994095c2d2fad022ab9fbcb535ae02f6a6020c3867ef797eb1b1fd92f76e499a6ed77f8caa093" -> "ad945aa1b32093e3dda48f41cab70fe0f2e9a2da0debd8b1607c638e5ad080d2971349679abb770ba7a83ee3469876308a608536d8852ec5a4a2a89c738ab507"
            # (1 unchanged attribute hidden)
        }
        # (8 unchanged blocks hidden)
    }
  # fastly_service_vcl.index will be created
  + resource "fastly_service_vcl" "index" {
      + activate           = true
      + active_version     = (known after apply)
      + cloned_version     = (known after apply)
      + comment            = "Managed by Terraform"
      + default_ttl        = 3600
      + force_refresh      = (known after apply)
      + http3              = false
      + id                 = (known after apply)
      + imported           = (known after apply)
      + name               = "index.crates.io"
      + stale_if_error     = false
      + stale_if_error_ttl = 43200
      + backend {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + domain {
          + name = "fastly-index.crates.io"
        }
      + domain {
          + name = "index.crates.io"
        }
    }
  # module.fastly_tls_subscription_index.aws_route53_record.tls_validation["fastly-index.crates.io"] will be created
  + resource "aws_route53_record" "tls_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z3HLPL7SRE1VK5"
    }
  # module.fastly_tls_subscription_index.aws_route53_record.tls_validation["index.crates.io"] will be created
  + resource "aws_route53_record" "tls_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z3HLPL7SRE1VK5"
    }
  # module.fastly_tls_subscription_index.fastly_tls_subscription.subscription will be created
  + resource "fastly_tls_subscription" "subscription" {
      + certificate_authority   = "globalsign"
      + certificate_id          = (known after apply)
      + common_name             = (known after apply)
      + configuration_id        = (known after apply)
      + created_at              = (known after apply)
      + domains                 = [
          + "fastly-index.crates.io",
          + "index.crates.io",
        ]
      + force_destroy           = false
      + force_update            = false
      + id                      = (known after apply)
      + managed_dns_challenge   = (known after apply)
      + managed_dns_challenges  = (known after apply)
      + managed_http_challenges = (known after apply)
      + state                   = (known after apply)
      + updated_at              = (known after apply)
    }
  # module.fastly_tls_subscription_index.fastly_tls_subscription_validation.subscription will be created
  + resource "fastly_tls_subscription_validation" "subscription" {
      + id              = (known after apply)
      + subscription_id = (known after apply)
    }
```